# üìä Introdu√ß√£o ao Pandas

Este notebook explora o b√°sico da biblioteca `pandas`, usada para an√°lise e manipula√ß√£o de dados em Python.

## üìù Parte 1: Instalando e Importando Pandas

Para come√ßar, certifique-se de ter a biblioteca instalada:
```python
pip install pandas
```

Agora, podemos import√°-la e carregar um conjunto de dados para explorar seus recursos.

# Dicion√°rio de dados ‚Äî `tips` (Seaborn)

| Coluna       | Tipo      | Descri√ß√£o                                                                 |
|--------------|-----------|---------------------------------------------------------------------------|
| `total_bill` | float     | Valor total da conta, em d√≥lares.                                         |
| `tip`        | float     | Valor da gorjeta, em d√≥lares.                                             |
| `sex`        | categoria | Sexo da pessoa que pagou a conta (`Male`, `Female`).                      |
| `smoker`     | categoria | Indica se havia fumantes na mesa (`Yes`, `No`).                           |
| `day`        | categoria | Dia da semana do registro (`Thur`, `Fri`, `Sat`, `Sun`).                  |
| `time`       | categoria | Per√≠odo da refei√ß√£o (`Lunch`, `Dinner`).                                  |
| `size`       | int       | Tamanho do grupo (n√∫mero de pessoas na mesa).                             |

In [1]:
import pandas as pd

# Lendo um dataset de exemplo (carregado do pr√≥prio Pandas)
df = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv')

print(len(df))

# Exibindo as 5 primeiras linhas
df.head()

244

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## üìå Parte 2: Informa√ß√µes B√°sicas do Dataset

### üìã Verificando a Estrutura dos Dados

In [2]:
# Exibindo informa√ß√µes sobre o DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [3]:
# Verificando estat√≠sticas descritivas
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

## üîé Parte 3: Sele√ß√£o e Filtragem de Dados

Podemos selecionar colunas espec√≠ficas e filtrar os dados com condi√ß√µes.

In [4]:
# Selecionando apenas a coluna 'total_bill'
df['total_bill'].head()

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
Name: total_bill, dtype: float64

In [11]:
# Selecionando apenas a coluna 'total_bill' - tail
df['total_bill'].tail()

239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, dtype: float64

In [5]:
# Filtrando os pedidos que deram gorjeta maior que 5
df[df['tip'] > 6]

     total_bill    tip     sex smoker   day    time  size
23        39.42   7.58    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
170       50.81  10.00    Male    Yes   Sat  Dinner     3
183       23.17   6.50    Male    Yes   Sun  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
214       28.17   6.50  Female    Yes   Sat  Dinner     3

## üìä Parte 4: Agrupamentos e Estat√≠sticas

Podemos agrupar os dados por categorias e calcular estat√≠sticas √∫teis.

In [6]:
set(df['day'])

{'Fri', 'Sat', 'Sun', 'Thur'}

In [10]:
# M√©dia do valor total da conta por dia
df.groupby('day')['total_bill'].mean()

day
Fri     17.151579
Sat     20.441379
Sun     21.410000
Thur    17.682742
Name: total_bill, dtype: float64

In [13]:
df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [6]:
df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [7]:
df['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [11]:
df['size'].value_counts()

size
2    156
3     38
4     37
5      5
1      4
6      4
Name: count, dtype: int64

In [12]:
# Contagem de pedidos por tipo de fumante
df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

## üõ† Parte 5: Modificando e Adicionando Colunas

Podemos criar novas colunas com base em c√°lculos sobre as colunas existentes.

In [16]:
# Criando uma nova coluna com a porcentagem da gorjeta
df['tip_percentage'] = (df['tip'] / df['total_bill']) * 100
df.head()

   total_bill   tip     sex smoker  day    time  size  tip_percentage
0       16.99  1.01  Female     No  Sun  Dinner     2        5.944673
1       10.34  1.66    Male     No  Sun  Dinner     3       16.054159
2       21.01  3.50    Male     No  Sun  Dinner     3       16.658734
3       23.68  3.31    Male     No  Sun  Dinner     2       13.978041
4       24.59  3.61  Female     No  Sun  Dinner     4       14.680765

## üöÄ Exerc√≠cios para Praticar

Agora que exploramos os conceitos b√°sicos do `pandas`, tente resolver os seguintes exerc√≠cios usando um novo dataset.

### üìå Exerc√≠cio 1: Carregar um novo dataset

Carregue o dataset de **pinguins** do Seaborn:

https://raw.githubusercontent.com/mwaskom/seaborn-data/master/penguins.csv

Explore a estrutura do dataset usando `df.info()` e `df.describe()`.

# Dicion√°rio de dados ‚Äî `penguins` (Seaborn)

| Coluna               | Tipo        | Descri√ß√£o                                                                 |
|----------------------|-------------|---------------------------------------------------------------------------|
| `species`            | categoria   | Esp√©cie do pinguim (`Adelie`, `Chinstrap`, `Gentoo`).                     |
| `island`             | categoria   | Ilha do arquip√©lago Palmer onde foi observado (`Torgersen`, `Biscoe`, `Dream`). |
| `bill_length_mm`     | float       | Comprimento do bico (culmen) em **mil√≠metros**.                           |
| `bill_depth_mm`      | float       | Profundidade/altura do bico em **mil√≠metros**.                            |
| `flipper_length_mm`  | float       | Comprimento da nadadeira em **mil√≠metros**.                               |
| `body_mass_g`        | float       | Massa corporal em **gramas**.                                             |
| `sex`                | categoria   | Sexo do indiv√≠duo (`Male`, `Female`).                                     |
| `year`               | int         | Ano de medi√ß√£o (2007‚Äì2009).                                               |

**Observa√ß√µes:**
- O dataset pode conter **valores ausentes (NaN)** em algumas colunas (ex.: medidas ou `sex`).
- Medidas morfom√©tricas foram coletadas em pinguins adultos no arquip√©lago Palmer (Ant√°rtida).

In [43]:
# Carregar o dataset dos pinguins
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/penguins.csv"
df = pd.read_csv(url)

print(len(df))

# Explorar a estrutura do dataset
df.info() # Informa√ß√µes gerais

344
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [48]:
df['Nova coluna'] = df['species'] + ' ' + df['island']
df['Nova coluna num√©rica'] = df['bill_depth_mm'] / df['body_mass_g']
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,Nova coluna,Nova coluna num√©rica
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE,Adelie Torgersen,0.004987
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE,Adelie Torgersen,0.004579
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE,Adelie Torgersen,0.005538
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,Adelie Torgersen,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE,Adelie Torgersen,0.005594

In [51]:
# Remover linha NaN
# df.dropna()

In [44]:
df.describe()  # Estat√≠sticas descritivas

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

### üìå Exerc√≠cio 2: Selecionar uma coluna espec√≠fica

Exiba apenas os valores da coluna `species`.

In [13]:
# Selecionando apenas a coluna 'species'
species_column = df["species"]
print(species_column.head())  # Exibir os primeiros valores

0    Adelie
1    Adelie
2    Adelie
3    Adelie
4    Adelie
Name: species, dtype: object

### üìå Exerc√≠cio 3: Filtrar os pinguins de uma determinada esp√©cie

Filtre e exiba apenas os pinguins da esp√©cie 'Adelie'.

In [22]:
# Filtrando apenas os pinguins da esp√©cie 'Adelie'
adelie_pinguins = df[df["species"] == "Adelie"]
adelie_pinguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [25]:
# adelie_pinguins['species'].value_counts()

### üìå Exerc√≠cio 4: Calcular estat√≠sticas

Calcule a m√©dia do tamanho do corpo (`body_mass_g`) para cada esp√©cie.

In [27]:
# m√©dia total da coluna

df['body_mass_g'].mean()

4201.754385964912

In [18]:
# Calculando a m√©dia do tamanho do corpo por esp√©cie
mean_body_mass = df.groupby("species")["body_mass_g"].mean()
print(mean_body_mass)

species
Adelie       3700.662252
Chinstrap    3733.088235
Gentoo       5076.016260
Name: body_mass_g, dtype: float64

### üìå Exerc√≠cio 5: Criar uma nova coluna

Crie uma nova coluna chamada `flipper_ratio`, que seja a raz√£o entre `flipper_length_mm` e `body_mass_g`.

In [40]:
# Criando a nova coluna com a raz√£o entre flipper_length_mm e body_mass_g
df["flipper_ratio"] = df["flipper_length_mm"] / df["body_mass_g"]
# Exibir as primeiras linhas para conferir a nova coluna
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,flipper_ratio
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE,0.048267
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE,0.048947
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE,0.060000
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE,0.055942

In [41]:
del df['flipper_length_mm']

In [42]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,body_mass_g,sex,flipper_ratio
0,Adelie,Torgersen,39.1,18.7,3750.0,MALE,0.048267
1,Adelie,Torgersen,39.5,17.4,3800.0,FEMALE,0.048947
2,Adelie,Torgersen,40.3,18.0,3250.0,FEMALE,0.060000
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,3450.0,FEMALE,0.055942

In [35]:
df = df[ df['body_mass_g'] > 3500 ]

In [37]:
len(df)

264